andykirik/pic1619_blinking_led/main_button.c
/*
 * File:   main_button.c
 * Author: akirik
 *
 * Created on January 9, 2018, 3:52 PM
 * 
 * Switch and a LED
 * Digital I/O
 * 
 *  Board connection (Microchip Curiosity Board 8-bit, PIC16F1619):
 *   PIN                	Module                         				  
 * -------------------------------------------                        
 *    RA5 (D4)             LED
 *    RA1 (D5)             LED
 *    RA2 (D6)             LED
 *    RC5 (D7)             LED
 *
 *    RC4 (S1)             BUTTON
 * 
 */

/* The __delay_ms() function is provided by XC8. 
It requires you define _XTAL_FREQ as the frequency of your system clock. 
We are using the internal oscillator at its default 500 kHz, so _XTAL_FREQ is defined as 500000. 
The compiler then uses that value to calculate how many cycles are required to give the requested delay. 
There is also __delay_us() for microseconds and _delay() to delay for a specific number of clock cycles. 
Note that __delay_ms() and __delay_us() begin with a double underscore whereas _delay() 
begins with a single underscore.
*/
#define _XTAL_FREQ 500000

#include <xc.h>

// CONFIG1
#pragma config FOSC     = INTOSC    // Oscillator Selection Bits->INTOSC oscillator: I/O function on CLKIN pin
#pragma config PWRTE    = OFF       // Power-up Timer Enable->PWRT disabled
#pragma config MCLRE    = ON        // MCLR Pin Function Select->MCLR/VPP pin function is MCLR
#pragma config CP       = OFF       // Flash Program Memory Code Protection->Program memory code protection is disabled
#pragma config BOREN    = ON        // Brown-out Reset Enable->Brown-out Reset enabled
#pragma config CLKOUTEN = OFF       // Clock Out Enable->CLKOUT function is disabled. I/O or oscillator function on the CLKOUT pin
#pragma config IESO     = ON        // Internal/External Switch Over->Internal External Switch Over mode is enabled
#pragma config FCMEN    = ON        // Fail-Safe Clock Monitor Enable->Fail-Safe Clock Monitor is enabled

// CONFIG2
#pragma config WRT      = OFF       // Flash Memory Self-Write Protection->Write protection off
#pragma config PPS1WAY  = ON        // Peripheral Pin Select one-way control->The PPSLOCK bit cannot be cleared once it is set by software
#pragma config ZCD      = OFF       // Zero Cross Detect Disable Bit->ZCD disable.  ZCD can be enabled by setting the ZCDSEN bit of ZCDCON
#pragma config PLLEN    = OFF       // PLL Enable Bit->4x PLL is enabled when software sets the SPLLEN bit
#pragma config STVREN   = ON        // Stack Overflow/Underflow Reset Enable->Stack Overflow or Underflow will cause a Reset
#pragma config BORV     = LO        // Brown-out Reset Voltage Selection->Brown-out Reset Voltage (Vbor), low trip point selected.
#pragma config LPBOR    = OFF       // Low-Power Brown Out Reset->Low-Power BOR is disabled
#pragma config LVP      = ON        // Low-Voltage Programming Enable->Low-voltage programming enabled

// CONFIG3
#pragma config WDTCPS   = WDTCPS1F  // WDT Period Select->Software Control (WDTPS)
#pragma config WDTE     = OFF       // Watchdog Timer Enable->WDT disabled
#pragma config WDTCWS   = WDTCWSSW  // WDT Window Select->Software WDT window size control (WDTWS bits)
#pragma config WDTCCS   = SWC       // WDT Input Clock Selector->Software control, controlled by WDTCS bits

// INIT
void sys_init()
{
	// To control Digital I/O use three registers: ANSEL, TRIS and PORT:

    // ANSELx registers
	// ANSEL and ANSELH control the mode of AN0 through AN11:
	// 0 sets the pin to digital mode and 1 sets the pin to analog mode.
        ANSELA = 0x00;
        ANSELB = 0x00;
        ANSELC = 0x00;

    // TRISx registers (This register specifies the data direction of each pin)
        TRISA 	= 0x00;     // Set All on PORTA as Output
        TRISB 	= 0x00;     // Set All on PORTB as Output
        TRISC 	= 0b11011111; // All on PORTC as Output, RC4 as Input

    // LATx registers (used instead of PORTx registers to write (read could be done on PORTx))
        LATA = 0x00;        // Set PORTA all 0
        LATB = 0x00;        // Set PORTB all 0
        LATC = 0x00;        // Set PORTC all 0

    // WPUx registers (pull up resistors)
        WPUA = 0x00; 
        WPUB = 0x00; 
        WPUC = 0xFF; 
        OPTION_REGbits.nWPUEN = 0;

    // ODx registers
        ODCONA = 0x00;
        ODCONB = 0x00;
        ODCONC = 0x00;

    // initial state of LED - OFF (redundant, just to show another method to set)
        LATAbits.LATA5 = 0;
}

void main(void) 
{
    sys_init();
    
    while(1)
    {
        LATAbits.LATA5 = PORTCbits.RC4 == 0 ? 1 : 0;    // RC4 == 0V (on)
        __delay_ms(50);                                 // Sleep 50 milliseconds
		
		/*if (0 == RC4) {                       		// Switch is normally open to 5V ...when pressed, RA3 is connected to GND
            __delay_ms(10);                     		// Debounce by delaying and checking if switch is still pressed
            if (0 == RC4)                       		// Сheck if still down
                LATAbits.LATA5 = 1;                           
        }
        else
            LATAbits.LATA5 = 0;
        */
    }
        
    return;
}
